---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsDuctRoutingPreferenceParam
source: html/3a9c9e1c-2d03-0896-fdfd-ac75f97a745e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsDuctRoutingPreferenceParam Property

"Routing Preferences"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsDuctRoutingPreferenceParam { get; }
```